// Функция-конструктор параметров заполняемых по статистике использования реквизитов объекта.
// Позволяет задать связь заполняемых реквизитов с "ключевыми" реквизитами объекта и, исходя из их значений,
// использовать их как разрезы и/или условия для сбора статистики использования.
//
// Возвращаемое значение:
//  Структура:
//     * РазрезыСбораСтатистики - Структура - список полей, задающих фильтр для получения объектов, по которым будет собираться статистика:
//         * ИспользоватьВсегда - Строка - имена ключевых реквизитов, разделенные запятыми,
//               которые участвуют в отборе объектов для сбора статистики всегда
//         * ИспользоватьТолькоЗаполненные - Строка - имена ключевых реквизитов, разделенные запятыми,
//               которые участвуют в отборе объектов для сбора статистики, только если они заполнены
//     * ЗаполнятьПриУсловии - Структура - список условий, допускающий заполнение реквизитов по статистике
//         * ПоляОбъектаЗаполнены - Строка - имена ключевых реквизитов, разделенные запятыми,
//               которые должны быть заполнены для начала сбора статистики
//         * ПоляОбъектаПусты - Строка - имена ключевых реквизитов, разделенные запятыми,
//               которые должны быть пусты для начала сбора статистики.
//
Функция ПараметрыЗаполняемыхРеквизитов() Экспорт
	
	РазрезыСбораСтатистики = Новый Структура("ИспользоватьВсегда, ИспользоватьТолькоЗаполненные");
	ЗаполнятьПриУсловии    = Новый Структура("ПоляОбъектаЗаполнены, ПоляОбъектаПусты");
	
	Параметры = Новый Структура;
	Параметры.Вставить("РазрезыСбораСтатистики", РазрезыСбораСтатистики);
	Параметры.Вставить("ЗаполнятьПриУсловии", ЗаполнятьПриУсловии);
	
	Возврат Параметры;
	
КонецФункции
