// Функция получает коэффициент пересчета из текущей валюты в новую валюту.
//
// Параметры:
//	ТекущаяВалюта - СправочникСсылка.Валюты - Текущая валюта документа
//	НоваяВалюта - СправочникСсылка.Валюты - Новая валюта документа
//	Дата - Дата - Дата документа.
//	БазоваяВалюта - СправочникСсылка.Валюты - Базовая валюта, относительно которой необходимо получить курс.
//											Если Неопределено, то курсы получаются относительно значения из константы БазоваяВалютаПоУмолчанию.
//	ПараметрыВариантаКурсаДоговора - См. РаботаСКурсамиВалютУТ.ПараметрыВариантаКурсаДоговора
//
// Возвращаемое значение:
//	Число - Коэффициент пересчета в новую валюту.
//
Функция ПолучитьКоэффициентПересчетаИзВалютыВВалюту(ТекущаяВалюта, НоваяВалюта, Дата, Знач БазоваяВалюта = Неопределено, ПараметрыВариантаКурсаДоговора = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(БазоваяВалюта) Тогда
		БазоваяВалюта = БазоваяВалютаПоУмолчанию();
	КонецЕсли;
	
	Если ПараметрыВариантаКурсаДоговора <> Неопределено 
		И ПараметрыВариантаКурсаДоговора.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.УстановленныйВДоговоре 
		И (ПараметрыВариантаКурсаДоговора.ВалютаВзаиморасчетов = ТекущаяВалюта 
			ИЛИ ПараметрыВариантаКурсаДоговора.ВалютаВзаиморасчетов = НоваяВалюта) Тогда
			Если ТекущаяВалюта <> НоваяВалюта Тогда
				Если ТекущаяВалюта = ПараметрыВариантаКурсаДоговора.ВалютаВзаиморасчетов Тогда
					КурсТекущейВалюты = РегистрыСведений.КурсыВалютРасчетовПоДоговорам.ПолучитьЗначенияКурсаВалютыДоговора(ПараметрыВариантаКурсаДоговора.Договор, Дата);
				Иначе
					КурсТекущейВалюты = ПолучитьКурсВалюты(ТекущаяВалюта, Дата, БазоваяВалюта);
				КонецЕсли;
				Если НоваяВалюта = ПараметрыВариантаКурсаДоговора.ВалютаВзаиморасчетов Тогда
					КурсНовойВалюты = РегистрыСведений.КурсыВалютРасчетовПоДоговорам.ПолучитьЗначенияКурсаВалютыДоговора(ПараметрыВариантаКурсаДоговора.Договор, Дата);
				Иначе
					КурсНовойВалюты = ПолучитьКурсВалюты(НоваяВалюта, Дата, БазоваяВалюта);
				КонецЕсли;
				Если КурсНовойВалюты.КурсЧислитель * КурсТекущейВалюты.КурсЗнаменатель <> 0 Тогда
					КоэффициентПересчета = 
						(КурсТекущейВалюты.КурсЧислитель * КурсНовойВалюты.КурсЗнаменатель) 
						/ (КурсНовойВалюты.КурсЧислитель * КурсТекущейВалюты.КурсЗнаменатель);
				Иначе
					КоэффициентПересчета = 0;
				КонецЕсли;
			Иначе
				КоэффициентПересчета = 1;
			КонецЕсли;
	Иначе
		ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		Если ПараметрыВариантаКурсаДоговора <> Неопределено Тогда
			ОбъектРасчетов = ПараметрыВариантаКурсаДоговора.ОбъектРасчетов;
		КонецЕсли;
		Если ТекущаяВалюта <> НоваяВалюта Тогда
			КурсТекущейВалюты = ПолучитьКурсВалюты(ТекущаяВалюта, Дата, БазоваяВалюта, ОбъектРасчетов);
			КурсНовойВалюты = ПолучитьКурсВалюты(НоваяВалюта, Дата, БазоваяВалюта, ОбъектРасчетов);
			Если КурсНовойВалюты.КурсЧислитель * КурсТекущейВалюты.КурсЗнаменатель <> 0 Тогда
				КоэффициентПересчета = 
					(КурсТекущейВалюты.КурсЧислитель * КурсНовойВалюты.КурсЗнаменатель) 
					/ (КурсНовойВалюты.КурсЧислитель * КурсТекущейВалюты.КурсЗнаменатель);
			Иначе
				КоэффициентПересчета = 0;
			КонецЕсли;
		Иначе
			КоэффициентПересчета = 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КоэффициентПересчета;
	
КонецФункции // ПолучитьКоэффициентПересчетаИзВалютыВВалюту()

// Возвращает базовую валюту по умолчанию.
//
// Возвращаемое значение:
//   СправочникСсылка.Валюты - 
//
Функция БазоваяВалютаПоУмолчанию() Экспорт
	
	Возврат Справочники.Валюты.рубль;

КонецФункции

Функция ПолучитьКурсВалюты(Знач Валюта, Знач ДатаКурса, Знач БазоваяВалюта = Неопределено, ОбъектРасчетов = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(БазоваяВалюта) Тогда
		БазоваяВалюта = БазоваяВалютаПоУмолчанию();
	КонецЕсли;
	
	Если Валюта = БазоваяВалюта Тогда
		Результат = Новый Структура();
		Результат.Вставить("Валюта",    Валюта);
		Результат.Вставить("ДатаКурса", ДатаКурса);
		Результат.Вставить("БазоваяВалюта", БазоваяВалюта);
		Результат.Вставить("КурсЧислитель", 1);
		Результат.Вставить("КурсЗнаменатель", 1);
	Иначе
		Результат = РегистрыСведений.ОтносительныеКурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта, БазоваяВалюта", Валюта, БазоваяВалюта));
		Результат.Вставить("Валюта",    Валюта);
		Результат.Вставить("ДатаКурса", ДатаКурса);
		Результат.Вставить("БазоваяВалюта", БазоваяВалюта);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

