// АПК:142-выкл Особенность реализации.
// Стандартная для данной конфигурации функция форматирования сумм
//
// Параметры: 
//  Сумма  - Число - число, которое мы хотим форматировать, 
//  Валюта - СправочникСсылка.Валюты - ссылка на элемент справочника валют, если задан, то к в результирующую строку
//           будет добавлено представление валюты
//  ЧН     - Строка - строка, представляющая нулевое значение числа,
//  ЧРГ    - Строка - символ-разделитель групп целой части числа.
//  КодЯзыка - Строка - Имя языка, страны, для которых будет выполняться форматирование числа
//
// Возвращаемое значение:
//  Строка - отформатированная должным образом строковое представление суммы.
//
Функция ФорматСумм(Знач Сумма, Валюта = Неопределено, ЧН = "", ЧРГ = "", КодЯзыка = Неопределено) Экспорт
	
	ФорматнаяСтрока = "ЧДЦ=2"
					+ ?(НЕ ЗначениеЗаполнено(ЧН), "", ";" + "ЧН=" + ЧН)
					+ ?(НЕ ЗначениеЗаполнено(ЧРГ),"", ";" + "ЧРГ=" + ЧРГ)
					+ ?(НЕ ЗначениеЗаполнено(КодЯзыка),"", ";" + "Л=" + КодЯзыка);
	РезультирующаяСтрока = СокрЛ(Формат(Сумма, ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		РезультирующаяСтрока = РезультирующаяСтрока + " " + СокрП(Валюта);
	КонецЕсли;

	Возврат РезультирующаяСтрока;

КонецФункции // ФорматСумм()
// АПК:142-вкл